app/controllers/api/v2/libraries_controller.rb

	def create
		authorize Library
		@library = Library.new(library_params)
		@library.created_by = @user.id
---
INSERT INTO "libraries" ("name", "description", "title", "created_by", "created_at", "updated_at", "ref_id") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update

		if @library.update(library_params)
---
UPDATE "libraries" SET "name" = ?, "description" = ?, "title" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["name", "asdfsdf"], ["description", "sd"], ["title", "asdf"], ["updated_at", "2018-04-13 05:26:37.566325"], ["id", 1]]

	def purchase
		@library.update_attributes(:purchased_on => Date.today, :in_possession_of => @library.user.id)
---
UPDATE "libraries" SET "purchased_on" = ?, "in_possession_of" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["purchased_on", "2018-04-13"], ["in_possession_of", 1], ["updated_at", "2018-04-13 04:30:56.073312"], ["id", 1]]

	def set_library
		@library = Library.find(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT 1  [["id", nil]]