app/controllers/api/v1/libraries_controller.rb

	def create
		@library = Library.new(library_params)
		@library.created_by = @user.id
---
INSERT INTO "libraries" ("description", "created_by", "created_at", "updated_at", "ref_id") VALUES (?, ?, ?, ?, ?)  [["description", "asdfasdfasdfasdf}"], ["created_by", 1], ["created_at", "2018-04-12 14:02:09.407581"], ["updated_at", "2018-04-12 14:02:09.407581"], ["ref_id", "84b13c7e5d34ee7daf8974cf1c9fb75c"]]

	def purchase
		@library.update_attributes(:purchased_on => Date.today, :in_possession_of => @library.user.id)
---
UPDATE "libraries" SET "purchased_on" = ?, "in_possession_of" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["purchased_on", "2018-04-13"], ["in_possession_of", 1], ["updated_at", "2018-04-13 03:47:54.517279"], ["id", 1]]