app/controllers/api/v1/registrations_controller.rb

	def sign_up
		# binding.pry
	    if params[:email].nil?
	      render :status => 400,
	      :json => {:message => 'email required.'}
	      return
	    elsif params[:password].nil? || params[:password_confirmation].nil?
	      render :status => 400,
	      :json => {:message => 'password required.'}
	      return
	  	elsif params[:type] != 'Normal' && params[:type] != 'Admin'
	      	render :status => 400,
	      	:json => {:message => 'type required Normal or Admin Capitalize.'}
	      return
	    end

	    if params[:email]
	      duplicate_user = User.find_by_email(params[:email])
	      unless duplicate_user.nil?
	        render :status => 409,
	        :json => {:message => 'Duplicate email. A user already exists with that email address.'}
	        return
	      end
	    end

	    if params[:type] == 'Admin'
	    	@user = Admin.create(sign_up_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "mahesh.bablu17@gmail.com"]]
INSERT INTO "users" ("type", "email", "encrypted_password", "name", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def sign_in
		if params[:email].nil? && params[:password].nil?
	      @user.errors.full_messages
	  	else
	    	@user = User.find_by_email(params[:email])
	    	if @user
		    	if @user.valid_password?(params[:password])
		    		# binding.pry
		    		if @user.access_token.nil?

						auth_token = rand_string(20)
						# auth_expiry = Time.now + (24*60*60)
						@user.access_token = auth_token
				        #@user.authtoken_expiry = auth_expiry
				        if @user.save(validate: false)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "mahesh.baSsdafDFblu17@gmail.com"]]
UPDATE "users" SET "access_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["access_token", "cZQRgVlkEwtHCNUgHStQa"], ["updated_at", "2018-04-12 11:34:03.355592"], ["id", 1]]

	def logout
		if params[:email]
			@user = User.find_by_email(params[:email])
			@user.update(:access_token => nil)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "mahesh@holanta.com"]]
UPDATE "users" SET "access_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["access_token", nil], ["updated_at", "2018-04-21 06:33:45.382174"], ["id", 5]]