app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
  def index
    if params[:file]
      Library.import(params[:file])
      redirect_to root_url
    else
      @libraries = Library.all

INSERT INTO "libraries" ("name", "description", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdf"], ["description", "asdfasdf"], ["created_by", 1], ["created_at", "2018-04-12 12:28:07.633167"], ["updated_at", "2018-04-12 12:28:07.633167"]]
---
  def create
    @library = Library.new(library_params)
    # binding.pry
    @library.created_by = current_user.id

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_library
      @library = Library.find(params[:id])